/*
과제1. 아이템 만들기

- 종류와 데미지, 가격이 다른 무기 및 방어구 + 악세사리 5종을 만들고 출력  총 15종

- 출력된 화면에는 아이템 종류에 따른 가격 + 특성이 함께 나열이 된다.

- 필수: 무기 1종 + 방어구 1종 + 악세사리 = 총 3종에 대해서는 도트를 만든다.

- 사이즈 : 20 x 20 



과제2. 랜덤 숫자 담기

- 공통으로 모두 출력을 시켜 확인이 되도록 만들어 온다.

- 1 ~ 6까지의 랜덤 숫자를 인트형 변수에 담는다.

- 6 ~ 19까지의 랜덤 숫자를 인트형 변수에 담는다.

- 23 ~189까지의 랜덤 숫자를 인트형 변수에 담는다.


※ 어제 연습한 한컴타자 연습 결과 + 도트찍은 결과물 =총 2장 ~3장
ㄴ 카카오톡 단톡방에 회신
ㄴ 이름

한줄조사. 반복문

- 반복문의 종류와 역할에 대해서 조사해 온다.
- 노트에 적어온다. 
= 카카오톡에 올리기

과제1. 반복문 출력

FOR WHITLE

- 99부터 1까지 출력

- 1부터 100까지 출력
ㄴ +짝수만 출력

과제2. 연산자 활용

-두개의 정수를 받아서 두수의 덧셈과 뺄셈의결과를 출력하는 프로그램을 작성한다.

- 3개의 정수(num1, num2,num3)를 받아서 다음 연산의 결과를 출력하는 프로그램 작성

(num1+num2)* (num3+num1) % num1=?

-입력받은 두 정수를 나누었을때 얻게 되는 몫과 나머지를 출력하는 프로그램을 작성한다.
EX) 7과 2가 입력되면 몫으로 3/ 나머지는 1이 출력되면 된다.

과제3. 반복문 숙달

- 정수 하나를 입력 받아 -5 씩 반복적으로 연산되는 식을 만든다.

- 종료조건: -15를 넘어가면 탈출

- 조건 : 입력받은 값은 -10 ~10 사이의 숫자여야하고 이외의 값 입력시 그냥 종료

※ 조건식과 논리 연산자를 잘 보고 조건식을 만들어 WHILE문이 돌아가게끔 만든다.



한줄조사. 조건문
- 노트에 적어온다
- 비유할것 생각해 온다(EX: 조건문은 000다.)

도전과제

마름모 출력 조건 for문 1번 한줄
                     





 2022-10-11



 과제1. 가위 바위 보 게임

 -if 문을 이용해 만든다.

ㄴ switch문은 사용하지 않는다.

-게임의 진행 횟수는 총 5판

ㄴ 이후는 게임 종료

- 필수: 치트키                     
                     
                     
 과제2. 일수 출력기


 - if문과 switch 문 중에 본인이 판단해 효율적인것을 선택해 만든다.
 
 -시작하면 사용자의 입력을 받고 입력한 숫자에 따라??일 인지 출력

 EX : 4입력시 4월은 30일 입니다. → 다시 입력 커맨드 활성화

 - 1월부터 12월까지 확인이 가능해야하고 이외의 숫자는 예외처리

 - 총 5번을 입력하면 프로그램은 종료된다.

 
 과제3.
 
 for문 
 * 
 **
 ***
 ****
 *****
 
 for문
 *****
 ****
 ***
 **
 *

 for문+ if문
 *
 **
 ***
 ****
 *****
 
 *****
 ****
 ***
 **
 *

 한줄조사. 함수
 - 노트에 적어온다.

 - 비유할것 적어온다. (함수는 000이다.

 도전 과제
 1. 가위바위보 심화(학원 첫수업분들은 도전과제 x)
 int scissorrockpaper(int*a, int *b, int *c, int**** r)
 const int * d =nullptr;
 int e= 0
 return e;



 2022-10-12
 char를 열심히쓰장

 과제. 가위바위보

 - switch문을 이용해 만든다.

 - 치트 기능과 배팅 기능 추가
 ㄴ 초기 소지금 10,000원 부터

 - 최소 배팅은 1,000원 부터

 ㄴ5판을 하거나 내가 가진 돈을 전부 일으면 게임을 종료한다

- 이기면 판돈에 X3배를 얻고 지면 판돈에 X7배를 잃는다

- 비길 경우 판돈에 X5를 얻는다.

과제 2. 복습

- 지금까지 배운 내용을 복습한다.

- 어떻게 복습을 했는지 구현화 시켜온다.


타임 어택. 가위바위보(if)


- 시간 15분

- 내일은 보류


한줄조사 . 배열
- 노트에 적어온다(비유할것 생각해 온다.)




과제1. 게임 평가 평균값 구하기

항목은 6개 (배열[6]{})

게임 평가: 캐릭터, 배경, 퀘스트, 아이템, 과금, 레이드(기타등등)




-조건 1차원 배열로 값을 정한뒤 평균값을 구해서 출력

ㄴ 값 입력 X



과제2. 숫자 야구

- 0 ~ 9까지의 숫자 중 컴퓨터가 임의로 3개를 뽑는다.

- 컴퓨터가 뽑은 숫자를 플레이어가 임의의 숫자 3개를 선택하여 숫자와 자릿수까지 맞추는 게임

1. 만약 선택한 숫자가 컴퓨터 숫자와같으나 자리수가 다를경우
ㄴ 1볼(1B)

2. 만약 선택한 숫자가 컴퓨터 숫자와 같고 자리수까지 같을 경우
ㄴ 1스트라이크(1S)

3. 만약 해당되는 숫자가 없으면
ㄴ 아웃(1 out)

- 이렇게 한 턴에 3s를 만들 경우 (3개의 자리수와 숫자가 같은 경우)
몆턴만에 맞췄는지 결과를 보여주며 게임을 끝낸다.

필수: 치트

(월요일날 타임어택 할꺼임)


한줄조사. 문자열

- 노트에 적어온다. (EX.문자열은 000이다)





2022- 10- 14


과제1. 슬롯머신


- 배팅을 하고 시작을 누르면 자동 시스템

- 777 같은 숫자 3개 나올시 배팅금액 12배


-7 을 제외한 같은 숫자 3개 나올시 배팅 금액의 5배

- 같은 숫자 2개 나올시 배팅 금액의 2배

-그외에는 전부 잃기
(1~ 9)


※ 필수: 치트 -> 임의로 동작하는 슬롯머신을 멈추는 키를 만들어 준 이후
내가 숫자 3개를 입력해서 777이 당첨되는걸 확인할 수 있게 만든다.

과제2. 월남뽕

-필수: 치트

- ◆  1~ 13까지의 카드 int 가능?

- ♠   1~13까지의 카드    

- ♣   1~ 13까지의 카드

- ♥   1~ 13까지의 카드
(카드 13장 씩 총 52장에 특수문자
- 종류멸 13장의 카드 총 52장의 카드를 사용한다.

A= 1

J= 11

Q = 12

K= 13 

- 52장의 카드를 최소 한번 랜덤으로 섞어주고 그후 매턴마다 3장씩 뒤집는다

- 앞쪽에 배치된 주장의 카드를 보고 최소 배팅액 이상의 금액을 배팅한다
- 배팅후 세번째 카드의 수가 앞서 오픈된 카드 수자의 사이에 있다면 배틍금이 
두배가 되어 소지금이 추가된다.

- 반대라면 소지금에서 배팅한 만큼 마이너스

- 초기 소지금: 10,000/ 최소 배팅액 1,000원

※ 한턴이 끝나고 사용된 카드는 버려지기 때문에 재사용할 수 없다.
(17판되면 끝나는거임)

# 같은숫자 카드가 3개 나오는건 따로 신경쓸 필요없다



과제3. 주민번호 생성기

- 시작하면 원하는 생년을 입력받는다 (4자리, 2자리 처리) 2000년생 배체
EX 1970/ 70

- 월과 일을 입력( 2자리, 1자리 처리)

EX: 06/ 6

예외처리 : 31일이 있는 달과 30일까지만 있는 달, 그리고 2월도 처리해야 한다.


- 성별선택 (남자는 1 or 3, 여자는 2 or 4)
ㄴ 다른 값을입력하면 성별을 랜덤하게 설정한다.

- 마지막 6자리는 랜덤하게 출력
단, 0이 오면 안된다.
(문자와 문자열 사용)


한줄조사. 사용자 정의 자료형 + 4대 문자열




2022-10-17


(OOP 정도만 찾아보고 + 객체 지향의 5대특징(5대 설계원칙 아님)(객체설계 보존의 원칙 요런거 XX)

과제1. 로또 당첨기

- 당첨번호 6개 + 보너스 번호 1개 // 구조체로 뽑을수 있나?  

-6 개입력

-1등: 당첨번호 6개와 내가 입력한 숫자 6개가 같을때// 

2등: 당첨번호 5개와 + 보너스 번호 1개

3등: 당첨번호 5개 

4등: 당첨번호 4개

5등: 당첨번호 3개

필수: 치트 


과제2. 복습 과제

- 두 정수 사이의 합을 구하는 프로그램을 구현한다

- 두개의 숫자를 사용자를 통해 입력 받는다.

- 입력한 두숫자 사이의 합이 출력되면 ok

- 예외처리: 5번과 1번을 누른다 ->x 높은 숫자 낮은 숫자는 x다는뜻

숫자의 합이 100이상/ 전체 횟수가 10번 이상이면 종료

ex: 1+ 5를 입력  -> 9 


타임어택. 월남뽕


한줄조사. 포인터




2022-10-18

과제1. 문자열 과제

- 문자를 입력 받아 입력받은 문자를 거꾸로 출력 
ㄴ EX: ABCD -> DCBA




- 있는 그대로를 출력하지만 짝수에 있는 문자만 거꾸로 출력
ㄴ EX: ASDFG -> AFDSG

- 주민번호를 입력하고 -가 제거된 주민번호로 출력
ㄴ EX: 1234567 - 1234456> - 없어짐

ㄴ문자열 포인터와 배열 포인터를 사용하면 굿
(영어만 입력 받으면 됩니다)

필수: 
ㄴstring 사용 금지




과제2. 하이로우세븐

-필수+ 치트 카드모양 

- ◆  1~ 13까지의 카드 

- ♠   1~13까지의 카드

- ♣   1~ 13까지의 카드

- ♥   1~ 13까지의 카드
(카드 13장 씩 총 52장에 특수문자
- 종류멸 13장의 카드 총 52장의 카드를 사용한다.

A= 1

J= 11

Q = 12

K= 13

= 52장의 카드를 최소 한번이상 랜덤으로 섞고 그후 매턴마다 5장씩 뒤집는다.
- 앞쪽에 배치된 다섯장의 카드를 보고 6번째 카드의 숫자를 예측한다.
- 6번째 숫자가 seven보다 높으면 Higt, 낮으면 Low, 아니면 같은지 (srven)중 하나에 배팅

- 세븐일 경우 13개 배당금 획득
- 초기 소지금 100,100원 / 최소배팅 5,000 /2배찍 잃음

▶ 통과 못한 인원
ㄴ 깜지 작성(3번)

한줄조사. 클래스






과제1. 미비된 과제 마무리 (끊어내기) 미련있으면 하기 아니면 말고




과제2. 짝 맞추기


- 사이즈 5 x 4
- ☆ ★ ◇ ◆ ♤ ♠ ♡ ♥ ♧ ♣

- 짝이 맞춰진 번호(문양)는 계속 오픈된 상태로 있어야 한다

- 2가지 버전 치트

- 1. 치트키를 누르면 패를 전부 오픈 시켜 플레이어에게 보여주고 5초뒤에 다시 원상 복귀

- 2. 치트키를 누르면 한쌍의 카드를 제외하고 전부 오픈 사용자가 마지막 한쌍을 맞추면서 게임이 종료된다


열심히 조사

- 노트에 적어온다.
ㄴ STLo , 벡터o, 맵o, 리스트o, 반복자O, 컨테이너 o, 자료구조, 스택o, 큐o, 트리O + @ (그래프)

*/



